

byte DoIPTest_902_req[18] =
{
    0x02, 0xFD, 0x80, 0x03, 0x00,
    0x00, 0x00, 0x0A, 0x0E, 0x01,
    0xA0, 0x00, 0x01, 0x02, 0x03,
    0x04, 0x05, 0x06
};

针对test_case中的触发事件备忘

801/802 是路由激活的正向回应,回应值一致.
803是判断车辆发现回应

901/902/903/904 是路由激活的正向回应，回应值一致.

701/702/703 是doip entity status状态回应,回应值一致.

601/602/603 是doip power mode回应，回应值一致.

501/502/503/504 都是alive check回应,回应值一致,但进行的判断不一致

401/402/403/404/404/405/407/408/409/410/411 先是路由激活回应(正向回应),后面是诊断数据.
406 是不路由激活直接发送诊断数据

1001/1002/1003/1004/1005 都是判断车辆(公告)发现回应

001/002/003/　都不需要判断时间的产生
004/005 需要判断车辆发现回应

201/202/203/206  判断车辆发现回应
204/205 判断车辆发现是否有回应

101/102/103 都是判断车辆发现回应


